// 模拟的后端接口返回数据
export const mockResponse = {
  data: {
    list: [
      {
        id: 1,
        name: "点1",
        proLineCoord: "POINT(120.15507 30.27415)"
      },
      {
        id: 2,
        name: "线1",
        proLineCoord: "LINESTRING(120.15507 30.27415, 120.1575 30.2769)"
      },
      {
        id: 3,
        name: "多线1",
        proLineCoord: "MULTILINESTRING((120.15507 30.27415, 120.1575 30.2769), (120.1580 30.2775, 120.1600 30.2790))"
      },
      {
        id: 4,
        name: "面1",
        proLineCoord: "POLYGON((120.15507 30.27415, 120.1575 30.27415, 120.1575 30.2769, 120.15507 30.2769, 120.15507 30.27415))"
      },
      {
        id: 5,
        name: "多面1",
        proLineCoord: "MULTIPOLYGON(((120.15507 30.27415, 120.1575 30.27415, 120.1575 30.2769, 120.15507 30.2769, 120.15507 30.27415)))"
      }
    ]
  }
};
